# PromptForFamilyInstancePlacementOptions Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PromptForFamilyInstancePlacementOptions Members
PromptForFamilyInstancePlacementOptions Class Constructors Methods Properties See Also
---
The PromptForFamilyInstancePlacementOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PromptForFamilyInstancePlacementOptions()()()() | Creates a new PromptForFamilyInstancePlacementOptions using default options. |
| PromptForFamilyInstancePlacementOptions(PromptForFamilyInstancePlacementOptions) | Creates a copy of an existing options object. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the PromptForFamilyInstancePlacementOptions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FaceBasedPlacementType | The placement type to be used if prompting to place an instance of a face-based family. This option is ignored if placing a non-face-based family. If placing a face-based family, Default is an acceptable value, but will correspond to the first available selection in the user interface. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| PlaceAirTerminalOnDuct | If true, when placing an air terminal, the terminal will be placed directly on the duct without fittings. If fase, the terminal will be placed with generated fittings. |
| SketchGalleryOptions | The sketch option provided when promt to place a family instance. |

# See Also
PromptForFamilyInstancePlacementOptions Class
Autodesk.Revit.UI Namespace